[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:47:9
             accessor: 'comments',
         },
 
-        {
-            Header: 'Reviewer Email',
-            accessor: 'reviewerEmail',
-        },
+        {},
 
         {
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
