[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:5:82
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom';
 
-function RecommedationRequestForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function RecommedationRequestForm({ initialContents, submitAction, buttonLabel = "" }) {
 
     
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequests/RecommendationRequestForm.js:26:14
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
 
             <Form.Group className="mb-3" >
killedBy: RecommendationRequestForm tests renders correctly when passing in a RecommendationRequest
statusReason: Error: Unable to find an element by: [data-testid="/RecommendationRequestForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:43:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="requesterEmail">Requester Email</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-requesterEmail"}
+                    data-testid={testIdPrefix + ""}
                     id="requesterEmail"
                     type="text"
killedBy: RecommendationRequestForm tests No Error messsages on good input
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestForm-requesterEmail"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:47:34
                     id="requesterEmail"
                     type="text"
                     isInvalid={Boolean(errors.requesterEmail)}
-                    {...register("requesterEmail", {
+                    {...register("", {
                         required: "Requester Email is required.",
                     })}
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:48:35
                     type="text"
                     isInvalid={Boolean(errors.requesterEmail)}
                     {...register("requesterEmail", {
-                        required: "Requester Email is required.",
+                        required: "",
                     })}
                 />
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Requester Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:63:52
                     id="professorEmail"
                     type="text"
                     isInvalid={Boolean(errors.professorEmail)}
-                    {...register("professorEmail", {
-                        required: "Professor Email is required."
-                    })}
+                    {...register("professorEmail", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Professor Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:78:49
                     id="explanation"
                     type="text"
                     isInvalid={Boolean(errors.explanation)}
-                    {...register("explanation", {
-                        required: "Explanation is required."
-                    })}
+                    {...register("explanation", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Explanation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:95:63
                     type="datetime-local"
                     isInvalid={Boolean(errors.dateRequested)}
                     // {...register("dateRequested", { required: true, pattern: isodate_regex })}
-                    {...register("dateRequested", { required: true})}
+                    {...register("dateRequested", { required: false})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Requested is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequests/RecommendationRequestForm.js:98:22
                     {...register("dateRequested", { required: true})}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.dateRequested && 'Date Requested is required. '}
+                    {true}
                     {/* {errors.dateRequested?.type === 'pattern' && 'Date Requested must be in ISO format'} */}
                 </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Requested is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequests/RecommendationRequestForm.js:98:22
                     {...register("dateRequested", { required: true})}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.dateRequested && 'Date Requested is required. '}
+                    {false}
                     {/* {errors.dateRequested?.type === 'pattern' && 'Date Requested must be in ISO format'} */}
                 </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Requested is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:111:60
                     type="datetime-local"
                     isInvalid={Boolean(errors.dateNeeded)}
                     // {...register("dateNeeded", { required: true, pattern: isodate_regex })}
-                    {...register("dateNeeded", { required: true })}
+                    {...register("dateNeeded", { required: false })}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Needed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/RecommendationRequests/RecommendationRequestForm.js:114:22
                     {...register("dateNeeded", { required: true })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.dateNeeded && 'Date Needed is required. '}
+                    {errors.dateNeeded || 'Date Needed is required. '}
                     {/* {errors.dateNeeded?.type === 'pattern' && 'Date Needed must be in ISO format'} */}
                 </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/RecommendationRequests/RecommendationRequestForm.js:114:22
                     {...register("dateNeeded", { required: true })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.dateNeeded && 'Date Needed is required. '}
+                    {false}
                     {/* {errors.dateNeeded?.type === 'pattern' && 'Date Needed must be in ISO format'} */}
                 </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Needed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:122:49
             <Form.Group className="mb-3">
                 <Form.Label htmlFor="done">Done</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-done"}
+                    data-testid={testIdPrefix + ""}
                     id="done"
                     as="select"
killedBy: RecommendationRequestForm tests No Error messsages on good input
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestForm-done"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:126:34
                     id="done"
                     as="select"
                     isInvalid={Boolean(errors.done)}
-                    {...register("done", {
+                    {...register("", {
                         required: "Done is required."
                     })}
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:127:35
                     as="select"
                     isInvalid={Boolean(errors.done)}
                     {...register("done", {
-                        required: "Done is required."
+                        required: ""
                     })}
                 >
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Done is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
