[Killed] BlockStatement
main/components/RecommendationRequests/RecommendationRequestTable.js:13:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/recommendationrequest/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/recommendationrequest/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:14:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/recommendationrequest/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/recommendationrequest/edit/1"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:37:23
         },
         {
             Header: 'Requester Email',
-            accessor: 'requesterEmail',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-requesterEmail"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:40:21
             accessor: 'requesterEmail',
         },
         {
-            Header: 'Professor Email',
+            Header: "",
             accessor: 'professorEmail',
         },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Professor Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:52:21
             accessor: 'dateRequested',
         },
         {
-            Header: 'Date Needed',
+            Header: "",
             accessor: 'dateNeeded',
         },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Date Needed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:53:23
         },
         {
             Header: 'Date Needed',
-            accessor: 'dateNeeded',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-dateNeeded"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:55:9
             Header: 'Date Needed',
             accessor: 'dateNeeded',
         },
-        {
-            Header: 'Done',
-            id: 'done',
-            accessor: (row, _rowIndex) => String(row.done)
-        }
+        {}
     ];
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/RecommendationRequests/RecommendationRequestTable.js:58:23
         {
             Header: 'Done',
             id: 'done',
-            accessor: (row, _rowIndex) => String(row.done)
+            accessor: () => undefined
         }
     ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /true|false/
Received string:  ""

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:63:43
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestTable"));
+        columns.push(ButtonColumn("Edit", "", editCallback, "RecommendationRequestTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestTable"));
     } 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:64:71
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestTable"));
+        columns.push(ButtonColumn("Delete", "danger", deleteCallback, ""));
     } 
 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
