[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsIndexPage.js:13:30
 
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        return (
-            <Button
-                variant="primary"
-                href="/recommendationrequest/create"
-                style={{ float: "right" }}
-            >
-                Create Recommendation Request 
-            </Button>
-        )
-    } 
-  }
+  const createButton = () => {}
   
   const { data: recommendationrequests, error: _error, status: _status } =
killedBy: RecommendationRequestsIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Recommendation Request/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsIndexPage.js:14:45
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        return (
-            <Button
-                variant="primary"
-                href="/recommendationrequest/create"
-                style={{ float: "right" }}
-            >
-                Create Recommendation Request 
-            </Button>
-        )
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
   }
   
killedBy: RecommendationRequestsIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Recommendation Request/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsIndexPage.js:19:33
             <Button
                 variant="primary"
                 href="/recommendationrequest/create"
-                style={{ float: "right" }}
+                style={{ float: "" }}
             >
                 Create Recommendation Request 
killedBy: RecommendationRequestsIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsIndexPage.js:31:17
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       ["/api/recommendationrequest/all"],
-      { method: "GET", url: "/api/recommendationrequest/all" },
+      { method: "", url: "/api/recommendationrequest/all" },
       []
     );
killedBy: RecommendationRequestsIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/recommendationrequest/all"
Received string:    "Error communicating with backend via  on /api/recommendationrequest/all"

[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestsIndexPage.js:31:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       ["/api/recommendationrequest/all"],
-      { method: "GET", url: "/api/recommendationrequest/all" },
+      {},
       []
     );
killedBy: RecommendationRequestsIndexPage tests renders three dates correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
