[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsEditPage.js:3:58
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RecommendationRequestsEditPage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RecommendationRequestsEditPage() {}
 
 
killedBy: RecommendationRequestsEditPage tests Renders expected content
statusReason: Error: RecommendationRequestsEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
