[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.js:3:60
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RecommendationRequestsCreatePage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RecommendationRequestsCreatePage() {}
 
 
killedBy: RecommendationRequestsCreatePage tests Renders expected content
statusReason: Error: RecommendationRequestsCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
