[Killed] BlockStatement
src/main/utils/RecommendationRequestUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/recommendationrequest",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 
killedBy: RecommendationRequestsIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "RecommendationRequest with id 1 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
src/main/utils/RecommendationRequestUtils.js:9:12
 }
 
 export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/recommendationrequest",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
+    return {}
 }
 
killedBy: RecommendationRequestsIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "RecommendationRequest with id 1 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
