[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:16:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/ucsbdiningcommonsmenuitem/edit/${cell.row.values.id}`) // item
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UCSBDiningCommonsMenuItemTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsbdiningcommonsmenuitem/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:45:9
             Header: 'Name',
             accessor: 'name',
         },
-        {
-            Header: 'Station',
-            accessor: 'station',
-        }
+        {}
     ];
 
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
