[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:9:31
 
 export default function UCSBDiningCommonsMenuItemCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (diningcommonsmenuitem) => ({
-    url: "/api/ucsbdiningcommonsmenuitem/post",
-    method: "POST",
-    params: {
-     id:diningcommonsmenuitem.id,
-     diningCommonsCode: diningcommonsmenuitem.diningCommonsCode,
-     name: diningcommonsmenuitem.name,
-     station: diningcommonsmenuitem.station
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (diningcommonsmenuitem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:12:13
   const objectToAxiosParams = (diningcommonsmenuitem) => ({
     url: "/api/ucsbdiningcommonsmenuitem/post",
     method: "POST",
-    params: {
-     id:diningcommonsmenuitem.id,
-     diningCommonsCode: diningcommonsmenuitem.diningCommonsCode,
-     name: diningcommonsmenuitem.name,
-     station: diningcommonsmenuitem.station
-    }
+    params: {}
   });
 
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "diningCommonsCode": "Ortega",
-   "name": "Chicken Caesar Salad",

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:21:11
   });
 
   const onSuccess = (diningcommonsmenuitem) => {
-    toast(`New diningcommonsmenuitem Created - id: ${diningcommonsmenuitem.id} name: ${diningcommonsmenuitem.name}`);
+    toast(``);
   }
 
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New diningcommonsmenuitem Created - id: 3 name: Chicken Caesar Salad"
Received: ""

Number of calls: 1
