[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (items) => ({
-        url: "/api/ucsbdiningcommonsmenuitem",
-        method: "PUT",
-        params: {
-            id: items.id,
-        },
-        data: {
-            diningCommonsCode: items.diningCommonsCode,
-            name: items.name,
-            station: items.station,
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (items) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Menu Item Updated - id: 17 diningCommonsCode: Ort name: Salad station: Entrees"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:24:48
             }
         );
 
-    const objectToAxiosPutParams = (items) => ({
-        url: "/api/ucsbdiningcommonsmenuitem",
-        method: "PUT",
-        params: {
-            id: items.id,
-        },
-        data: {
-            diningCommonsCode: items.diningCommonsCode,
-            name: items.name,
-            station: items.station,
-        }
-    });
+    const objectToAxiosPutParams = (items) => ({});
 
     const onSuccess = (items) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Menu Item Updated - id: 17 diningCommonsCode: Ort name: Salad station: Entrees"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:27:17
     const objectToAxiosPutParams = (items) => ({
         url: "/api/ucsbdiningcommonsmenuitem",
         method: "PUT",
-        params: {
-            id: items.id,
-        },
+        params: {},
         data: {
             diningCommonsCode: items.diningCommonsCode,
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:37:34
         }
     });
 
-    const onSuccess = (items) => {
-      toast(`Menu Item Updated - id: ${items.id} diningCommonsCode: ${items.diningCommonsCode} name: ${items.name} station: ${items.station}`);
-    }
+    const onSuccess = (items) => {}
 
     const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] LogicalOperator
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:63:21
             <div className="pt-2">
                 <h1>Edit Menu Item</h1>
                 {
-                    items && <UCSBDiningCommonsMenuItemForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={items} />
+                    items || <UCSBDiningCommonsMenuItemForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={items} />
                 }
             </div>
killedBy: UCSBDiningCommonsMenuItemEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="UCSBDiningCommonsMenuItemForm-diningCommonsCode" id="diningCommonsCode" name="diningCommonsCode" type="text" /> instead

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:63:21
             <div className="pt-2">
                 <h1>Edit Menu Item</h1>
                 {
-                    items && <UCSBDiningCommonsMenuItemForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={items} />
+                    false
                 }
             </div>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-diningCommonsCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
