[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:68:35
                     type="text"
                     isInvalid={Boolean(errors.comments)}
                     {...register("comments", {
-                        required: "Comment is required."
+                        required: ""
                     })}
                 />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comment is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:87:38
                         required: "reviewerEmail is required.",
                         pattern: {
                             value: email_form,
-                            message: "Invalid email address format."
+                            message: ""
                         }
                     })}
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Invalid email address format/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:99:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="star">Stars</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-star"}
+                    data-testid={testIdPrefix + ""}
                     id="star"
                     type="number"
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewForm-star"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:103:34
                     id="star"
                     type="number"
                     isInvalid={Boolean(errors.star)}
-                    {...register("star", {
+                    {...register("", {
                         required: "Stars is required.",
                         min: {value: 1, message: "Number must be >= 1"},
killedBy: MenuItemReviewForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:106:50
                     {...register("star", {
                         required: "Stars is required.",
                         min: {value: 1, message: "Number must be >= 1"},
-                        max: {value: 5, message: "Number must be <= 5"}
+                        max: {value: 5, message: ""}
                     })}
                 />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Number must be <= 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:106:30
                     {...register("star", {
                         required: "Stars is required.",
                         min: {value: 1, message: "Number must be >= 1"},
-                        max: {value: 5, message: "Number must be <= 5"}
+                        max: {}
                     })}
                 />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Number must be <= 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:110:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.star?.message}
+                    {errors.star.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:127:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateReviewed && 'dateReviewed in iso format is required'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /dateReviewed in iso format is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:127:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateReviewed && 'dateReviewed in iso format is required'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /dateReviewed in iso format is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
